---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamTotalSheetMass
source: html/be4450a3-7027-3dbb-16f0-3cdcaac2c13e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamTotalSheetMass Property

"Total Sheet Mass": Calculated all sheet mass: Volume of Wire * Unit Weight.

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamTotalSheetMass { get; }
```